{"class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Dense", "config": {"bias_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.0003, "minval": -0.0003}}, "trainable": true, "name": "L1", "dtype": "float32", "use_bias": true, "units": 32, "batch_input_shape": [null, 3], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.003, "minval": -0.003}}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "L3", "trainable": true, "activation": "elu"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.0003, "minval": -0.0003}}, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.003, "minval": -0.003}}, "name": "L4", "bias_constraint": null, "use_bias": true, "units": 64, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "L6", "trainable": true, "activation": "elu"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.0003, "minval": -0.0003}}, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.003, "minval": -0.003}}, "name": "L10", "bias_constraint": null, "use_bias": true, "units": 1, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "activation": "tanh"}}], "backend": "tensorflow"}