{"class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow", "config": [{"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 1, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "batch_input_shape": [null, 16], "momentum": 0.99, "scale": true, "beta_regularizer": null, "dtype": "float32", "epsilon": 0.001, "beta_constraint": null}}, {"class_name": "Dense", "config": {"name": "L1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.01, "seed": null, "mean": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 400}}, {"class_name": "BatchNormalization", "config": {"name": "L2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 1, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null}}, {"class_name": "Activation", "config": {"name": "L3", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "L4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.01, "seed": null, "mean": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 300}}, {"class_name": "BatchNormalization", "config": {"name": "L5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 1, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null}}, {"class_name": "Activation", "config": {"name": "L6", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"name": "L10", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.01, "seed": null, "mean": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 4}}]}