{"class_name": "Model", "keras_version": "2.0.8", "backend": "tensorflow", "config": {"layers": [{"name": "batch_normalization_3_input", "class_name": "InputLayer", "config": {"sparse": false, "name": "batch_normalization_3_input", "dtype": "float32", "batch_input_shape": [null, 16]}, "inbound_nodes": []}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 1, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "batch_input_shape": [null, 16], "momentum": 0.99, "scale": true, "beta_regularizer": null, "dtype": "float32", "epsilon": 0.001, "beta_constraint": null}, "inbound_nodes": [[["batch_normalization_3_input", 0, 0, {}]]]}, {"name": "L1", "class_name": "Dense", "config": {"name": "L1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.01, "seed": null, "mean": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 400}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "L2", "class_name": "BatchNormalization", "config": {"name": "L2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 1, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null}, "inbound_nodes": [[["L1", 0, 0, {}]]]}, {"name": "batch_normalization_4_input", "class_name": "InputLayer", "config": {"sparse": false, "name": "batch_normalization_4_input", "dtype": "float32", "batch_input_shape": [null, 4]}, "inbound_nodes": []}, {"name": "3", "class_name": "Activation", "config": {"name": "3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["L2", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 1, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "batch_input_shape": [null, 4], "momentum": 0.99, "scale": true, "beta_regularizer": null, "dtype": "float32", "epsilon": 0.001, "beta_constraint": null}, "inbound_nodes": [[["batch_normalization_4_input", 0, 0, {}]]]}, {"name": "L4", "class_name": "Dense", "config": {"name": "L4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "batch_input_shape": [null, 16], "dtype": "float32", "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.01, "seed": null, "mean": 0.0}}, "kernel_regularizer": null, "units": 150}, "inbound_nodes": [[["3", 0, 0, {}]]]}, {"name": "L7", "class_name": "Dense", "config": {"name": "L7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.01, "seed": null, "mean": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 150}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "L5", "class_name": "BatchNormalization", "config": {"name": "L5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 1, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null}, "inbound_nodes": [[["L4", 0, 0, {}]]]}, {"name": "L8", "class_name": "BatchNormalization", "config": {"name": "L8", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": 1, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null}, "inbound_nodes": [[["L7", 0, 0, {}]]]}, {"name": "L6", "class_name": "Activation", "config": {"name": "L6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["L5", 0, 0, {}]]]}, {"name": "L9", "class_name": "Activation", "config": {"name": "L9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["L8", 0, 0, {}]]]}, {"name": "L10", "class_name": "Merge", "config": {"output_mask": null, "output_shape": null, "mode_type": "raw", "output_mask_type": "raw", "mode": "concat", "name": "L10", "arguments": {}, "dot_axes": -1, "output_shape_type": "raw", "concat_axis": -1}, "inbound_nodes": [[["L6", 0, 0, {"mask": [null, null]}], ["L9", 0, 0, {"mask": [null, null]}]]]}, {"name": "output", "class_name": "Dense", "config": {"name": "output", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "trainable": true, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"stddev": 0.01, "seed": null, "mean": 0.0}}, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 1}, "inbound_nodes": [[["L10", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["batch_normalization_3_input", 0, 0], ["batch_normalization_4_input", 0, 0]], "output_layers": [["output", 0, 0]]}}