{"class_name": "Model", "keras_version": "2.0.8", "config": {"output_layers": [["output", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "name": "L1_input", "dtype": "float32", "batch_input_shape": [null, 3]}, "name": "L1_input"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "name": "L7_input", "dtype": "float32", "batch_input_shape": [null, 1]}, "name": "L7_input"}, {"class_name": "Dense", "inbound_nodes": [[["L1_input", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.0003, "minval": -0.0003}}, "trainable": true, "name": "L1", "dtype": "float32", "use_bias": true, "units": 32, "batch_input_shape": [null, 3], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.003, "minval": -0.003}}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null}, "name": "L1"}, {"class_name": "Dense", "inbound_nodes": [[["L7_input", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.0003, "minval": -0.0003}}, "trainable": true, "name": "L7", "dtype": "float32", "use_bias": true, "units": 32, "batch_input_shape": [null, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.003, "minval": -0.003}}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null}, "name": "L7"}, {"class_name": "Activation", "inbound_nodes": [[["L1", 0, 0, {}]]], "config": {"name": "3", "trainable": true, "activation": "elu"}, "name": "3"}, {"class_name": "Activation", "inbound_nodes": [[["L7", 0, 0, {}]]], "config": {"name": "L9", "trainable": true, "activation": "elu"}, "name": "L9"}, {"class_name": "Merge", "inbound_nodes": [[["3", 0, 0, {"mask": [null, null]}], ["L9", 0, 0, {"mask": [null, null]}]]], "config": {"output_mask": null, "output_shape_type": "raw", "name": "L10", "output_shape": null, "arguments": {}, "dot_axes": -1, "mode": "concat", "mode_type": "raw", "output_mask_type": "raw", "concat_axis": -1}, "name": "L10"}, {"class_name": "Dense", "inbound_nodes": [[["L10", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.0003, "minval": -0.0003}}, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.003, "minval": -0.003}}, "name": "L11", "bias_constraint": null, "use_bias": true, "units": 128, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "activation": "elu"}, "name": "L11"}, {"class_name": "Dense", "inbound_nodes": [[["L11", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.0003, "minval": -0.0003}}, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.003, "minval": -0.003}}, "name": "output", "bias_constraint": null, "use_bias": true, "units": 1, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear"}, "name": "output"}], "name": "model_2", "input_layers": [["L1_input", 0, 0], ["L7_input", 0, 0]]}, "backend": "tensorflow"}